const express = require("express");
const cors = require("cors");
const app = express();

app.use(cors());
const stationName = "Вільногірськ";

const busesData = [
  {
    id: "b1",
    route: "Міський автобус",
    directions: [
      {
        title: "Від МЦЛ (нова лікарня)",
        rows: [
          ["Щоденно*", "06:00"], ["до маг. Ольга**", "07:30"], ["Щоденно*", "08:30"], 
          ["Щоденно*", "10:10"], ["до маг. Ольга**", "12:10"], ["до маг. Ольга**", "14:10"], 
          ["Крім вихідних*", "15:20"], ["Крім вихідних*", "16:40"]
        ]
      },
      {
        title: "Від залізничного вокзалу",
        rows: [
          ["Щоденно*", "07:00"], ["від маг. Ольга**", "07:40"], ["Щоденно*", "09:05"], 
          ["Щоденно*", "11:00"], ["від маг. Ольга**", "14:00"], ["від маг. Ольга**", "15:00"], 
          ["Крім вихідних*", "16:10"]
        ]
      }
    ],
    note: "*Згідно зміни розкладу електропоїздів. Час відправлення можна уточнювати у водія<br>**Крім вихідних."
  },
  {
    id: "b2",
    route: "До Дніпра (ч/з Божедарівку)",
    directions: [
      { title: "З Вільногірська", rows: [["Рейс 1", "06:00"], ["Рейс 2", "10:00"], ["Рейс 3", "13:00"]] },
      { title: "З Дніпра (АС1)", rows: [["Рейс 1", "07:00"], ["Рейс 2", "10:00"], ["Рейс 3", "13:00"]] }
    ],
    note: ""
  },
  {
    id: "b3",
    route: "До Дніпра (ч/з Кам'янське)",
    directions: [
      { title: "З Вільногірська", rows: [["Рейс 1", "05:10"], ["Рейс 2", "14:10"]] },
      { title: "З Дніпра (АС1)", rows: [["Рейс 1", "08:10"], ["Рейс 2", "17:10"]] }
    ],
    note: "* Йдуть повз зализничий вокзал Кам'янське-Пас."
  },
  {
    id: "b4",
    route: "Кривий Ріг ⇄ В-Дніпровськ",
    directions: [
      { title: "До Кривого Рігу", rows: [["З Вільногірська", "06:25"]] },
      { title: "До В-Дніпровську", rows: [["З Вільногірська", "16:20"]] }
    ],
    note: "*Крім вихідних"
  },
  {
    id: "b5",
    route: "Вільногірськ ⇄ Лихівка",
    directions: [
      { title: "З Вільногірська", rows: [["Рейс 1", "10:30"], ["Рейс 2", "14:45"]] },
      { title: "З Лихівки", rows: [["Рейс 1", "11:35"], ["Рейс 2", "15:55"]] }
    ],
    note: ""
  },
  {
    id: "b6",
    route: "Вільногірськ ⇄ с. Водяне",
    directions: [
      { title: "З Вільногірська", rows: [["Рейс 1", "05:40"], ["Рейс 2", "10:00"], ["Рейс 3", "17:30"]] },
      { title: "З с. Водяне", rows: [["Рейс 1", "06:30"], ["Рейс 2", "10:50"], ["Рейс 3", "18:20"]] }
    ],
    note: ""
  }
];

app.get("/", (req, res) => {
  res.send("🚌 Сервер автобусів працює!");
});

app.get("/api/buses", (req, res) => {
  res.json({
    station: stationName,
    buses: busesData
  });
});

const PORT = process.env.PORT || 8080;
app.listen(PORT, () => {
  console.log(`Сервер автобусів запущено на порту ${PORT}`);
});
